docs/posts/2015-05-10-prayer-for-mothers-day.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 31, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Prayer for Mothers Day</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Prayer for Mothers Day</h1>
<p class="subtitle" role="doc-subtitle">May 10, 2015</p>
</header><p>
Mother&rsquo;s Day can be an awkward time in the life of the church. There is a great deal of internal pressure to commemorate the day, but we should acknowledge that there are many who are understandably uncomfortable on this day. There are those who may have painful memories of abuse at the hand of their biological mothers, others who may have never known their mothers, and many others who have never had, nor will ever have, children of their own. So, in this week&rsquo;s prayer, I&rsquo;ve tried to celebrate, not motherhood per se, but the nature of caregivers, whoever they may be.
</p>

<p>
Loving God,
</p>

<p>
We give thanks this day,<br>
for those who care<br>
for children,<br>
for aging parents,<br>
and for neighbors,<br>
for anyone who needs<br>
a warm smile,<br>
a cheerful greeting,<br>
or a kind word.
</p>


<p>
And we are blessed<br>
by those who<br>
love every child<br>
as one of their own,<br>
for reflected<br>
in their eyes,<br>
we see the face<br>
of Jesus.
</p>

<p>
<i>Amen</i>
</p>



<div class="tagline" id="orge5a8f18">
<p>
Tagged: <a href="../tags/prayer.html">Prayer</a> <a href="../tags/religion.html">Religion</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 31, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
